wisteria-1c/Конфигурация/Catalogs/Комиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Комиссии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтраслевойДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияРасформирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписаниеПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияФункционируетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодписиКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоПодписьПредседателяКомиссии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодписьЧленаКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/Комиссии/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПодписаниеПриказа) Тогда
		
		Объект.ДатаПодписаниеПриказа = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВидовДокументовНаСервере();
	УправлениеДоступностью();
	
	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли; 
	
	АдаптацияФормыТакси();
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьДублиФизическихЛиц(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодписиКомиссииЭтоПодписьПредседателяКомиссииПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ПодписиКомиссии.ТекущиеДанные;
	Для каждого СтрокаТаблицы Из Объект.ПодписиКомиссии Цикл
		
		Если СтрокаТаблицы.ЭтоПодписьПредседателяКомиссии
			И ДанныеТекущейСтроки <> СтрокаТаблицы Тогда
			
			СтрокаТаблицы.ЭтоПодписьПредседателяКомиссии = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписиКомиссииПриИзменении(Элемент)
	
	Если Объект.ПодписиКомиссии.Количество() = 1 Тогда
		
		Объект.ПодписиКомиссии[0].ЭтоПодписьПредседателяКомиссии = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если ЭтоИнтерфейс85 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДатаПодписаниеПриказа.Заголовок = НСтр("ru = 'от'");
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностью()
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ГруппаДатаНомерПриказа");
	МассивЭлементов.Добавить("ГруппаЗаголовок");
	МассивЭлементов.Добавить("Организация");
	МассивЭлементов.Добавить("СтруктурныеЕдиницы");
	МассивЭлементов.Добавить("ВидДокумента");
	
	МассивЭлементов.Добавить("ПодписиКомиссии");
	МассивЭлементов.Добавить("ПериодДействияКомиссии");
	МассивЭлементов.Добавить("ГруппаУтвердил");
	
	КомиссияИспользуетсяВДокументах = Справочники.Комиссии.КомиссияИспользуетсяВДокументах(Объект.Ссылка);
	Для каждого ЭлементаМассива Из МассивЭлементов Цикл
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементаМассива, "ТолькоПросмотр",
			КомиссияИспользуетсяВДокументах);
		
	КонецЦикла;
	
	Если КомиссияИспользуетсяВДокументах Тогда
		ТекстСообщения = НСтр("ru = 'Комиссия используется в документах, поэтому изменения недопустимы'");
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщения.ТипСообщения = "Предупреждение";
		ПараметрыСообщения.Сообщение = ТекстСообщения;
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Редактирование запрещено'");
		ПараметрыСообщения.Скрываемый = Ложь;
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидовДокументовНаСервере()
	
	СоответствиеДокументов = Справочники.Комиссии.ДокументыСКомиссиями();
	Для каждого ЗначениеСоответствия Из СоответствиеДокументов Цикл
		
		Элементы.ВидДокумента.СписокВыбора.Добавить(ЗначениеСоответствия.Ключ, ЗначениеСоответствия.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДублиФизическихЛиц(Отказ)
	
	ТаблицаФизическихЛиц = Объект.ПодписиКомиссии.Выгрузить(, "ПодписьЧленаКомиссии");
	
	ТаблицаФизическихЛиц.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число"));
	ТаблицаФизическихЛиц.ЗаполнитьЗначения(1, "Счетчик");
	ТаблицаФизическихЛиц.Свернуть("ПодписьЧленаКомиссии", "Счетчик");
	
	ШаблонСообщения = НСтр("ru ='Физическое лицо %1 добавлено более одного раза в комиссию. Необходимо пересмотреть состав комиссии.'");
	Для каждого СтрокаТаблицы Из ТаблицаФизическихЛиц Цикл
		
		Если СтрокаТаблицы.Счетчик > 1 Тогда
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, СтрокаТаблицы.ПодписьЧленаКомиссии), , , , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
